import { PatchNotesType } from '@/types/patchNote';

export const patchNotes: PatchNotesType[] = [
  {
    versionNO: '5.41.144',
    patchNotes: [
      { text: 'نام فروشنده در لیست های ستونی مرکز خرید', type: 'add' },
      {
        text: 'پیام "با کلیک روی هر سوال یا گزینه‌های روبروی اون، می‌تونین به اون سوال پیمایش کنین!" در مودال پاسخ برگ',
        type: 'add',
      },
      { text: 'امکان پخش خودکار قسمت بعدی به محض اتمام قسمت قبلی در صفحه دوره', type: 'add' },
      { text: 'و استفاده از آیکون‌های مینیمال جدید', type: 'upgrade' },
      { text: 'دانلود محتوای به روز شده در حالت وجود محتوای از قبل دانلود شده', type: 'edit' },
    ],
  },
  {
    versionNO: '5.40.138',
    patchNotes: [
      {
        text: 'قابلیت بسته شدن کیبورد به محض به حد نصاب رسیدن تعداد کاراکتر در صفحات ورود شماره موبایل و ورود کد تأیید',
        type: 'add',
      },
      { text: 'به روز شدن تعداد در سبد هر محصول در لیست ها در صورت تغییر از سایر بخش ها', type: 'edit' },
      { text: 'و حذف واژه "پلی لیست" از صفحه Intro مرکز آموزش', type: 'edit' },
    ],
  },
  {
    versionNO: '5.40.130',
    patchNotes: [
      { text: 'بخش جدید دکترمگ', type: 'add' },
      { text: 'تصویر و متن معرفی دکترمارکت به صفحه Intro', type: 'add' },
      { text: 'متن مناسب در زمان 0 بودن هزینه ارسال (تب سبد خرید)', type: 'add' },
      { text: 'در گزینه های فیلتر مرکز خرید', type: 'upgrade' },
      { text: 'مراحل 5 گانه سفارش (مرکز خرید)', type: 'edit' },
      { text: 'عدم نمایش قیمت محصولات ناموجود', type: 'edit' },
      { text: 'جایگزینی بیمه من با ابزارهای من در تب اصلی برنامه', type: 'edit' },
      { text: 'و کامنت کردن دکترکلاب', type: 'edit' },
    ],
  },
  {
    versionNO: '5.39.124',
    patchNotes: [
      { text: 'نمایش اکثر خطاها به کاربر روی مودال در زمان باز بودن مودال', type: 'add' },
      {
        text: 'سرعت تست زنی و سایر عملیات ها در انواع لیست سوالات (بانک سوال، آزمون ساز و ...)',
        type: 'upgrade',
      },
      { text: 'رابط کاربری صفحه اطلاعات من کلبه مشابه مودال اطلاعات من فروشگاه', type: 'edit' },
      { text: 'رابط کاربری صفحه ارائه دهنده', type: 'edit' },
      { text: 'رابط کاربری صفحه ناشر', type: 'edit' },
      { text: 'پرش به آخرین صفحه مطالعه شده بعد از باز شدن کتاب (صفحه محتوا)', type: 'edit' },
      { text: 'بسته شدن مودال پاسخ برگ با انتخاب سوال', type: 'edit' },
      { text: 'رنگ های مودال تاریخ تولد از قرمز به سبز (صفحه اطلاعات من)', type: 'edit' },
      { text: 'رنگ نشانگر غیرفعال اسلایدر به خاکستری (صفحه طرح های من)', type: 'edit' },
      { text: 'رنگ زمینه نام دوره و حاشیه تصویر ارائه دهنده به قرمز (صفحه دوره)', type: 'edit' },
      { text: 'رنگ حاشیه تصویر ناشر به آبی پررنگ (صفحه محتوا)', type: 'edit' },
      { text: 'رنگ نشانگر تب فعال، حاشیه کادر جستجو و آیکون آن به بنفش کم رنگ (مرکز آزمون)', type: 'edit' },
      {
        text: 'فاصله بین آخرین ردیف و کلید تأیید در مودال مبحث (تب های بانک سوال و آزمون ساز)',
        type: 'edit',
      },
      {
        text: 'ارتفاع کلید فیلتر کن و نشون بده و برجسته کردن متن آن (تب های بانک سوال و آزمون ساز)',
        type: 'edit',
      },
    ],
  },
  {
    versionNO: '5.34.114',
    patchNotes: [
      { text: 'شماره همراه به زیر نام گیرنده در لیست آدرس ها (تب سبد خرید)', type: 'add' },
      { text: 'آیکون (+) به کلید افزودن آدرس جدید در لیست آدرس ها (تب سبد خرید)', type: 'add' },
      { text: 'آیکون به کلیدهای حذف و ویرایش در لیست آدرس ها (تب سبد خرید)', type: 'add' },
      { text: 'سرعت تست زدن و ... در لیست سوالات تب بانک سوال (آزمایشی)', type: 'upgrade' },
      { text: 'فاصله بین نقشه و بالای اسکرول ویو در مودال آدرس (تب سبد خرید)', type: 'edit' },
    ],
  },
];
