import { Metadata } from "next";
import { homeMetadata as SharedHomeMetadata } from "@repo/core/metadata/home";

const title = "دکتراگزم | مرکز آزمون دکترآباد";
const description =
  "بانک جامع سوالات علوم پزشکی کشور؛ بیش از ۷۰ هزار سوال با پاسخ‌های تستی رایگان و پاسخ‌های تشریحی همگام با آخرین رفرنس‌های وزارت بهداشت، درمان و آموزش پزشکی، آزمون‌های بین‌المللی دو زبانه، آزمون‌ساز و صدور کارنامه تحلیلی";

const sharedHomeMetadata = SharedHomeMetadata("/exam", title, description);

export const homeMetadata: Metadata = {
  ...sharedHomeMetadata,
  keywords: [
    ...(sharedHomeMetadata.keywords as string[]),
    "آزمون",
    "دکتراباد",
    "دکتر اباد",
    "دکترآباد",
    "دکتر آباد",
    "مرکز آزمون",
    "وزارت بهداشت",
    "دانلود سوالات وزرت بهداشت",
    "سوالات علوم پایه",
    "آزمون علوم پایه پزشکی",
    "آزمون علوم پایه دندانپزشکی",
    "آزمون دستیاری پزشکی",
    "کارشناسی ارشد وزارت بهداشت",
    "کارشناسی ارشد پرستاری",
    "ارشد علوم آزمایشگاهی",
    "ارشد روانشناسی",
    "کارشناسی ارشد",
    "وزارت بهداشت",
    "پیش کارورزی",
    "پره انترنی",
    "ارتقا",
    "آزمون ارتقا",
    "سوالات آزپون علوم پایه",
    "سوالات بورد",
    "سوالات آزمون تخصص",
    "سوالات آزمون بورد و ارتقا",
    "سوالات آزمون پره انترنی",
    "سوالات آزمون داروسازی",
    "تخصص داروسازی",
    "لیسانس به پزشکی",
    "سوالات آزمون لیسانس به پزشکی",
    "سوالات usmle",
    "آزمون USMLE",
    "آزمون آمریکا",
    "آزمون استرالیا",
    "آزمون آلمان",
    "ارشد پرستاری",
    "ارشد روانشناسی",
  ],
};
