import BlogImage from '@/assets/img/product.jpg'

export const blogSliderData = [
    {
        id: 1,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
    {
        id: 2,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
    {
        id: 3,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
    {
        id: 4,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
    {
        id: 5,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
    {
        id: 6,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
    {
        id: 7,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
    {
        id: 8,
        image: BlogImage,
        title: 'مولتی ویتامین گوارش (مولتی مدیای بیماری‌های گوارشی + درسنامه تعاملی ویتامین)',
        category: 'دکترمارکت | لوازم پزشکی'
    },
]