export function getFriendlyVideoErrorMessage(code?: number): string {
  switch (code) {
    case 1:
      return "پخش ویدیو قبل از بارگذاری کامل متوقف شد.";
    case 2:
      return "به دلیل مشکل در شبکه، ویدیو بارگذاری نشد. لطفاً اتصال اینترنت خود را بررسی کنید و دوباره تلاش کنید.";
    case 3:
      return "مرورگر شما قادر به پردازش یا پخش این ویدیو نیست.";
    case 4:
      return `به دلیل مشکل در شبکه یا به دلیل پشتیبانی نشدن فرمت، ویدیو بارگذاری نشد.
     لطفاً اتصال اینترنت خود را بررسی کنید و دوباره تلاش کنید، در صورت تداوم مشکل با پشتیبانی تماس بگیرید.`;
    case 5:
      return "این ویدیو رمزگذاری‌شده یا محافظت‌شده است و امکان پخش آن در اینجا وجود ندارد.";
    default:
      return "هنگام پخش ویدیو مشکلی پیش آمد.";
  }
}
